# Найдите сумму цифр трехзначного числа. 
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = 123
c = n%10
d = n//10
b = d%10
a = d//10
s = a + b + c
print(f"{n} -> {s} ({a} + {b} + {c})")